; domain
(define (domain liftedtcore_blocksworld-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :action-costs)
 (:types block)
 (:constants
   brown_block_1 white_block_1 blue_block_1 orange_block_1 red_block_1 - block
 )
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block) (hold_0) (hold_1) (hold_2) (hold_3) (hold_4) (hold_5) (hold_6) (hold_7))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (when (and (not (on blue_block_1 brown_block_1)) (ontable red_block_1) (not (= ?obj red_block_1))) (not (hold_1))) (when (not (and (ontable red_block_1) (not (= ?obj red_block_1)))) (hold_1)) (when (and (on red_block_1 orange_block_1) (ontable white_block_1) (not (= ?obj white_block_1))) (hold_2)) (when (not (and (ontable white_block_1) (not (= ?obj white_block_1)))) (hold_3)) (when (and (not (and (ontable white_block_1) (not (= ?obj white_block_1)))) (not (on brown_block_1 red_block_1))) (not (hold_4))) (when (and (not (on red_block_1 red_block_1)) (not (or (not (and (clear orange_block_1) (not (= ?obj orange_block_1)))) (not (on orange_block_1 white_block_1))))) (not (hold_6))) (when (or (not (and (clear orange_block_1) (not (= ?obj orange_block_1)))) (not (on orange_block_1 white_block_1))) (hold_6)) (when (and (not (and (ontable brown_block_1) (not (= ?obj brown_block_1)))) (clear brown_block_1) (not (= ?obj brown_block_1))) (hold_7)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (when (and (not (on blue_block_1 brown_block_1)) (or (= ?obj red_block_1) (ontable red_block_1))) (not (hold_1))) (when (not (or (= ?obj red_block_1) (ontable red_block_1))) (hold_1)) (when (and (on red_block_1 orange_block_1) (or (= ?obj white_block_1) (ontable white_block_1))) (hold_2)) (when (not (or (= ?obj white_block_1) (ontable white_block_1))) (hold_3)) (when (and (not (or (= ?obj white_block_1) (ontable white_block_1))) (not (on brown_block_1 red_block_1))) (not (hold_4))) (when (and (not (on red_block_1 red_block_1)) (not (or (not (or (= ?obj orange_block_1) (clear orange_block_1))) (not (on orange_block_1 white_block_1))))) (not (hold_6))) (when (or (not (or (= ?obj orange_block_1) (clear orange_block_1))) (not (on orange_block_1 white_block_1))) (hold_6)) (when (and (not (or (= ?obj brown_block_1) (ontable brown_block_1))) (or (= ?obj brown_block_1) (clear brown_block_1))) (hold_7)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (when (not (or (and (= ?obj blue_block_1) (= ?underobj brown_block_1)) (on blue_block_1 brown_block_1))) (hold_0)) (when (and (not (or (and (= ?obj blue_block_1) (= ?underobj brown_block_1)) (on blue_block_1 brown_block_1))) (ontable red_block_1)) (not (hold_1))) (when (and (or (and (= ?obj red_block_1) (= ?underobj orange_block_1)) (on red_block_1 orange_block_1)) (ontable white_block_1)) (hold_2)) (when (and (not (ontable white_block_1)) (not (or (and (= ?obj brown_block_1) (= ?underobj red_block_1)) (on brown_block_1 red_block_1)))) (not (hold_4))) (when (or (and (= ?obj brown_block_1) (= ?underobj red_block_1)) (on brown_block_1 red_block_1)) (hold_4)) (when (not (or (and (= ?obj red_block_1) (= ?underobj red_block_1)) (on red_block_1 red_block_1))) (hold_5)) (when (and (not (or (and (= ?obj red_block_1) (= ?underobj red_block_1)) (on red_block_1 red_block_1))) (not (or (not (or (= ?obj orange_block_1) (and (clear orange_block_1) (not (= ?underobj orange_block_1))))) (not (or (and (= ?obj orange_block_1) (= ?underobj white_block_1)) (on orange_block_1 white_block_1)))))) (not (hold_6))) (when (or (not (or (= ?obj orange_block_1) (and (clear orange_block_1) (not (= ?underobj orange_block_1))))) (not (or (and (= ?obj orange_block_1) (= ?underobj white_block_1)) (on orange_block_1 white_block_1)))) (hold_6)) (when (and (not (ontable brown_block_1)) (or (= ?obj brown_block_1) (and (clear brown_block_1) (not (= ?underobj brown_block_1))))) (hold_7)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (when (not (and (on blue_block_1 brown_block_1) (not (and (= ?obj blue_block_1) (= ?underobj brown_block_1))))) (hold_0)) (when (and (not (and (on blue_block_1 brown_block_1) (not (and (= ?obj blue_block_1) (= ?underobj brown_block_1))))) (ontable red_block_1)) (not (hold_1))) (when (and (on red_block_1 orange_block_1) (not (and (= ?obj red_block_1) (= ?underobj orange_block_1))) (ontable white_block_1)) (hold_2)) (when (and (not (ontable white_block_1)) (not (and (on brown_block_1 red_block_1) (not (and (= ?obj brown_block_1) (= ?underobj red_block_1)))))) (not (hold_4))) (when (and (on brown_block_1 red_block_1) (not (and (= ?obj brown_block_1) (= ?underobj red_block_1)))) (hold_4)) (when (not (and (on red_block_1 red_block_1) (not (and (= ?obj red_block_1) (= ?underobj red_block_1))))) (hold_5)) (when (and (not (and (on red_block_1 red_block_1) (not (and (= ?obj red_block_1) (= ?underobj red_block_1))))) (not (or (not (or (= ?underobj orange_block_1) (and (clear orange_block_1) (not (= ?obj orange_block_1))))) (not (and (on orange_block_1 white_block_1) (not (and (= ?obj orange_block_1) (= ?underobj white_block_1)))))))) (not (hold_6))) (when (or (not (or (= ?underobj orange_block_1) (and (clear orange_block_1) (not (= ?obj orange_block_1))))) (not (and (on orange_block_1 white_block_1) (not (and (= ?obj orange_block_1) (= ?underobj white_block_1)))))) (hold_6)) (when (and (not (ontable brown_block_1)) (or (= ?underobj brown_block_1) (and (clear brown_block_1) (not (= ?obj brown_block_1))))) (hold_7)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_blocksworld-problem)
 (:domain liftedtcore_blocksworld-domain)
 (:objects
 )
 (:init (ontable brown_block_1) (on white_block_1 brown_block_1) (on orange_block_1 white_block_1) (ontable red_block_1) (on blue_block_1 orange_block_1) (clear red_block_1) (clear blue_block_1) (handempty) (hold_0) (hold_3) (hold_5) (hold_6) (= (total-cost) 0))
 (:goal (and (holding blue_block_1) (hold_0) (hold_1) (hold_2) (hold_3) (hold_4) (hold_5) (hold_6) (hold_7)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack blue_block_1 orange_block_1)
   deleted: (on blue_block_1 orange_block_1) (clear blue_block_1) (handempty) (hold_6)
   added: (holding blue_block_1) (clear orange_block_1)
   goals met: 4 of 9
2. (putdown blue_block_1)
   deleted: (holding blue_block_1)
   added: (clear blue_block_1) (handempty) (ontable blue_block_1)
   goals met: 3 of 9
3. (unstack orange_block_1 white_block_1)
   deleted: (on orange_block_1 white_block_1) (clear orange_block_1) (handempty)
   added: (holding orange_block_1) (clear white_block_1) (hold_6)
   goals met: 4 of 9
4. (putdown orange_block_1)
   deleted: (holding orange_block_1)
   added: (clear orange_block_1) (handempty) (ontable orange_block_1)
   goals met: 4 of 9
5. (pickup red_block_1)
   deleted: (clear red_block_1) (ontable red_block_1) (handempty)
   added: (holding red_block_1) (hold_1)
   goals met: 5 of 9
6. (stack red_block_1 orange_block_1)
   deleted: (clear orange_block_1) (holding red_block_1)
   added: (handempty) (clear red_block_1) (on red_block_1 orange_block_1)
   goals met: 5 of 9
7. (unstack white_block_1 brown_block_1)
   deleted: (on white_block_1 brown_block_1) (clear white_block_1) (handempty)
   added: (holding white_block_1) (clear brown_block_1)
   goals met: 5 of 9
8. (putdown white_block_1)
   deleted: (holding white_block_1)
   added: (clear white_block_1) (handempty) (ontable white_block_1) (hold_2)
   goals met: 6 of 9
9. (pickup brown_block_1)
   deleted: (clear brown_block_1) (ontable brown_block_1) (handempty)
   added: (holding brown_block_1)
   goals met: 6 of 9
10. (stack brown_block_1 red_block_1)
   deleted: (clear red_block_1) (holding brown_block_1)
   added: (handempty) (clear brown_block_1) (on brown_block_1 red_block_1) (hold_4) (hold_7)
   goals met: 8 of 9
11. (pickup blue_block_1)
   deleted: (clear blue_block_1) (ontable blue_block_1) (handempty)
   added: (holding blue_block_1)
   goals met: 9 of 9
